## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [1]:
import pandas as pd

In [2]:
# загружаем датасет
df = pd.read_csv("D:/WORK/datasets/adult.data.csv")
df.head(10)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

In [3]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [4]:
sex_counter = df['sex'].value_counts()
sex_counter

sex
Male      21790
Female    10771
Name: count, dtype: int64

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [5]:
avg_male_age = df[df['sex'] == 'Male']['age'].mean()
print(f"Average age of men: {avg_male_age:.2f}")

Average age of men: 39.43

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [6]:
df[df['native-country'] == 'United-States']['native-country'].value_counts().sum()
usa_citizen_ratio = (df[df['native-country'] == 'United-States']['native-country'].value_counts().sum()) * 100 / (df['native-country'].value_counts().sum())
print(f"Percentage of Usa people: {usa_citizen_ratio:.3f} %")

Percentage of Usa people: 89.586 %

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [7]:
df.head(2)
fewer_income = df[df['salary'] == '<=50K']
better_income = df[df['salary'] == '>50K']
avg_age_fi = fewer_income['age'].mean()
avg_age_bi = better_income['age'].mean()
std_age_fi = fewer_income['age'].std()
std_age_bi = better_income['age'].std()
print(f"Salary <=50K: \n Average age: {avg_age_fi:.2f}      Standart age deviation: {std_age_fi:.2f}\n")
print(f"Salary >50K: \n Average age: {avg_age_bi:.2f}      Standart agedeviation: {std_age_bi:.2f}\n")

Salary <=50K:
 Average age: 36.78      Standart age deviation: 14.02

Salary >50K:
 Average age: 44.25      Standart agedeviation: 10.52

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [8]:
better_income.head(5)
bi_education = better_income['education'].value_counts().reset_index()
bi_education
#ну вроде видно и так что это вранье, но я так понимаю надо именно проверку написать xD

       education  count
0      Bachelors   2221
1        HS-grad   1675
2   Some-college   1387
3        Masters    959
4    Prof-school    423
5      Assoc-voc    361
6      Doctorate    306
7     Assoc-acdm    265
8           10th     62
9           11th     60
10       7th-8th     40
11          12th     33
12           9th     27
13       5th-6th     16
14       1st-4th      6

In [9]:
ed = list(bi_education['education'])
ed

['Bachelors',
 'HS-grad',
 'Some-college',
 'Masters',
 'Prof-school',
 'Assoc-voc',
 'Doctorate',
 'Assoc-acdm',
 '10th',
 '11th',
 '7th-8th',
 '12th',
 '9th',
 '5th-6th',
 '1st-4th']

In [10]:
filter = ['Bachelors', 'Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters', 'Doctorate']
res = []
for x in ed:
    if x not in filter:
        res.append(x)
if not res:
    print("People with more than 50k had at least graduated the higher educational establishment")
else:
    print(f"People with more than 50k also had minimum education of: \n- {'\n- '.join(res)}")

People with more than 50k also had minimum education of:
- HS-grad
- Some-college
- 10th
- 11th
- 7th-8th
- 12th
- 9th
- 5th-6th
- 1st-4th

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [11]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [12]:
race_table = df.groupby(['sex', 'race'])['age'].agg([('avg_age', 'mean'), ('n_of_people', 'count'), ('max_age', 'max')]).reset_index()
print(race_table)
race_table.describe()

      sex                race    avg_age  n_of_people  max_age
0  Female  Amer-Indian-Eskimo  37.117647          119       80
1  Female  Asian-Pac-Islander  35.089595          346       75
2  Female               Black  37.854019         1555       90
3  Female               Other  31.678899          109       74
4  Female               White  36.811618         8642       90
5    Male  Amer-Indian-Eskimo  37.208333          192       82
6    Male  Asian-Pac-Islander  39.073593          693       90
7    Male               Black  37.682600         1569       90
8    Male               Other  34.654321          162       77
9    Male               White  39.652498        19174       90

         avg_age   n_of_people    max_age
count  10.000000     10.000000  10.000000
mean   36.682312   3256.100000  83.800000
std     2.335244   6163.273561   6.908931
min    31.678899    109.000000  74.000000
25%    35.520101    169.500000  77.750000
50%    37.162990    519.500000  86.000000
75%    37.811165   1565.500000  90.000000
max    39.652498  19174.000000  90.000000

didn't get that one so far

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [13]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [14]:
mar_status_male = better_income[better_income['sex'] == 'Male']['marital-status'].value_counts().reset_index()
married_men = mar_status_male[mar_status_male['marital-status'].str.contains('^Married')]['count'].sum()
not_married_men = mar_status_male[~mar_status_male['marital-status'].str.contains('^Married')]['count'].sum()
print(f"Among men who earned more than 50k there were {married_men} married and {not_married_men} who were not")

Among men who earned more than 50k there were 5965 married and 697 who were not

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [15]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [16]:
salary_and_hours = df.iloc[:, 12:15:2]
salary_and_hours

       hours-per-week salary
0                  40  <=50K
1                  13  <=50K
2                  40  <=50K
3                  40  <=50K
4                  40  <=50K
...               ...    ...
32556              38  <=50K
32557              40   >50K
32558              40  <=50K
32559              20  <=50K
32560              40   >50K

[32561 rows x 2 columns]

In [17]:
print(f"Max amount of working hours is {salary_and_hours['hours-per-week'].max()}\n")
max_hours = salary_and_hours[salary_and_hours['hours-per-week'] == 99].value_counts()
print(max_hours)
trudyagi = (list(max_hours)[1] + list(max_hours)[0])
bogatie_trudyagi = list(max_hours)[1] *100 / (list(max_hours)[1] + list(max_hours)[0])
print(f"\n There were {trudyagi} people who worked max hours and among them only {bogatie_trudyagi:.2f} %  earned more than 50k")

Max amount of working hours is 99

hours-per-week  salary
99              <=50K     60
                >50K      25
Name: count, dtype: int64

 There were 85 people who worked max hours and among them only 29.41 %  earned more than 50k

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [18]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [19]:
national_worktime = df.groupby(['native-country', 'salary'])['hours-per-week'].agg([('avg_worktime', 'mean')])
national_worktime

                       avg_worktime
native-country salary
?              <=50K      40.164760
               >50K       45.547945
Cambodia       <=50K      41.416667
               >50K       40.000000
Canada         <=50K      37.914634
...                             ...
United-States  >50K       45.505369
Vietnam        <=50K      37.193548
               >50K       39.200000
Yugoslavia     <=50K      41.600000
               >50K       49.500000

[82 rows x 1 columns]

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответсвтуещей группы для каждого человека в новой колонке AgeGroup**

In [20]:
df_age_group = df.copy()
df_age_group.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [21]:
def age_group_sort(x):
    if x >= 16 and x < 35:
        return 'young'
    elif x >= 35 and x < 70:
        return 'adult'
    elif  x >= 70 and x < 100:
        return 'retiree'
    else:
        return 'no info given'
df_age_group['AgeGroup'] = df_age_group['age'].apply(age_group_sort)
df_age_group

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,AgeGroup
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,adult
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,adult
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,adult
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,adult
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,young
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K,young
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K,adult
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K,adult
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K,young
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K,adult

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [22]:
age_group_working = df_age_group.groupby(['AgeGroup', 'salary'])['age'].agg([('amount', 'count')])
print(age_group_working)
age_bi = age_group_working.reset_index() #bi - better income, same as above
result_group = age_bi[(age_bi['salary'] == ">50K")].sort_values('amount', ascending=False).iloc[0]
result_group
print(f'\nThe oldest age group who earned more than 50K is "{result_group['AgeGroup']}" and there were {result_group['amount']} of them')

                 amount
AgeGroup salary
adult    <=50K    11643
         >50K      6240
retiree  <=50K      516
         >50K       113
young    <=50K    12561
         >50K      1488

The oldest age group who earned more than 50K is "adult" and there were 6240 of them

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [57]:
grouped_oc = df_age_group.iloc[:, 0:13:6]
grouped_oc

       age         occupation  hours-per-week
0       39       Adm-clerical              40
1       50    Exec-managerial              13
2       38  Handlers-cleaners              40
3       53  Handlers-cleaners              40
4       28     Prof-specialty              40
...    ...                ...             ...
32556   27       Tech-support              38
32557   40  Machine-op-inspct              40
32558   58       Adm-clerical              40
32559   22       Adm-clerical              20
32560   52    Exec-managerial              40

[32561 rows x 3 columns]

In [56]:
table_oc = df_age_group.groupby('occupation').agg({'age': ['count', 'mean'], 'hours-per-week': ['min']}).reset_index()
table_oc.columns = ['occupation', 'number_of_people', 'avg_age', 'min_worktime']
table_oc

           occupation  number_of_people    avg_age  min_worktime
0                   ?              1843  40.882800             1
1        Adm-clerical              3770  36.964456             1
2        Armed-Forces                 9  30.222222             8
3        Craft-repair              4099  39.031471             1
4     Exec-managerial              4066  42.169208             1
5     Farming-fishing               994  41.211268             2
6   Handlers-cleaners              1370  32.165693             2
7   Machine-op-inspct              2002  37.715285             1
8       Other-service              3295  34.949621             1
9     Priv-house-serv               149  41.724832             4
10     Prof-specialty              4140  40.517633             1
11    Protective-serv               649  38.953775             3
12              Sales              3650  37.353973             2
13       Tech-support               928  37.022629             3
14   Transport-moving              1597  40.197871             5

function making in the nutshell

In [63]:
def filter_occupation(some_table):
    final_occupation = []
    for i in range(len(some_table)):
        x = some_table.iloc[i]
        if x['avg_age'] <= 40 and x['min_worktime'] > 5:
            final_occupation.append(x)
    if final_occupation:
        return pd.DataFrame(final_occupation)
    else:
        print('Nothing is matching the filtering conditions')
        return None

In [67]:
drumroll = filter_occupation(table_oc)
drumroll

     occupation  number_of_people    avg_age  min_worktime
2  Armed-Forces                 9  30.222222             8